read_verilog triport.v
synth_xilinx -top triport
write_verilog triport_xilinx.v
